sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
		#if defined(WF_CS_TRIS)
			WFEintISR();
		#endif // WF_CS_TRIS
	}

	#if !defined(HI_TECH_C)
	#pragma code lowVector=0x18
	void LowVector(void){_asm goto LowISR _endasm}
	#pragma code highVector=0x8
	void HighVector(void){_asm goto HighISR _endasm}
	#pragma code // Return to default code section
	#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
	void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
	{
	    Nop();
		Nop();
	}
	void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
	{
	    Nop();
		Nop();
	}
	
#elif defined(__C32__)
	void _general_exception_handler(unsigned cause, unsigned status)
	{
		Nop();
		Nop();
	}
#endif
static const DWORD Interval = 2000000;
static const DWORD StepPulse = 1000000;
static DWORD_VAL OC1R_;
static DWORD_VAL OC1RS_;
static BYTE OC1Mode = 0b011;
static BYTE Toggle = 0;

void __attribute__((__interrupt__,__no_auto_psv__)) _OC1Interrupt( void )
{
    /* Interrupt Service Routine code goes here */
    if(OC1Mode == 0b011){
        
        if(Toggle){
            OC1R_.Val += Interval;              
            Toggle = 0;  
        } else {
            Toggle = 1;
            OC1R_.Val += StepPulse;
        }     
        LATDbits.LATD0 = Toggle;      
        if(OC1R_.word.HW == 0 ){
            OC1R = OC1R_.word.LW;          
        } else {           
            OC1CONbits.OCM = 0b000; // Disable Output Compare Module     
        }    
    } else 
    if (OC1Mode == 0b101){
        OC1R  = OC1R_.word.LW;
        OC1RS = OC1RS_.word.LW;
    }    
    
    IFS0bits.OC1IF = 0; // Clear OC1 interrupt flag
}
void __attribute__((__interrupt__,__no_auto_psv__)) _T2Interrupt( void )
{
/* Interrupt Service Routine code goes here */
    if(OC1Mode == 0b011){
        if(OC1R_.word.HW>0)
        {
            OC1R_.word.HW--;
        } 
        if(OC1R_.word.HW == 0){
            OC1R = OC1R_.word.LW;                                
            IFS0bits.OC1IF = 0;     // Clear Output Compare 1 Interrupt Flag
            OC1CONbits.OCM = OC1Mode; // Select the Output Compare mode 
            IEC0bits.OC1IE = 1;     // Enable Output Compare 1 interrupt
        }
    }   
    IFS0bits.T2IF = 0; // Clear OC1 interrupt flag
}

//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{
	static DWORD t = 0;
	static DWORD dwLastIP = 0;
	//volatile DWORD UTCT;
	LATFbits.LATF4 = 0;
	TRISFbits.TRISF4 = 0;	
	// Initialize application specific hardware
	// ƒл€ работы A13  его нужно отключить от ADC
	{
		TRISAbits.TRISA12 = 1;
		AD1CON1 = 0;
		AD2CON1 = 0;
		AD1PCFGH = 0xFFFF;
		AD1PCFGL = 0xFFFF;
		AD2PCFGL = 0xFFFF;
	}
	
	TRISDbits.TRISD0 = 0;
	LATDbits.LATD0 = 0;
	OC1R_.Val = Interval; 
	OC1RS_.Val = OC1R_.Val + StepPulse;
	/*
	// Initialize Output Compare Module
    OC1CONbits.OCM = 0b000; // Disable Output Compare Module
    OC1CONbits.OCTSEL = 0;  // Select Timer 2 as output compare time base
     // Load the Compare Register Value for rising edge
    if(OC1R_.word.HW == 0){
        OC1R = OC1R_.word.LW;         
    } else {
        OC1R = 0;
    }    
    // Load the Compare Register Value for falling edge
    if(OC1RS_.word.HW == 0){           
        OC1RS = OC1RS_.word.LW;            
    } else {
        OC1RS = 0;
    } 
    
    IPC0bits.OC1IP = 0x01;  // Set Output Compare 1 Interrupt Priority Level
    IFS0bits.OC1IF = 0;     // Clear Output Compare 1 Interrupt Flag
    if((OC1R_.word.HW == 0)&&(OC1RS_.word.HW == 0)){
        OC1Mode = 0b101;     //Continuous Pulse mode
        OC1CONbits.OCM =  OC1Mode; // Select the Output Compare mode     
    }else{
        OC1Mode = 0b011;    //Toggle mode
    }
   
    
    IEC0bits.OC1IE = 1;     // Enable Output Compare 1 interrupt
    
                            // Initialize and enable Timer2
    T2CONbits.TON = 0; // Disable Timer
    T2CONbits.TCS = 0; // Select internal instruction cycle clock
    T2CONbits.TGATE = 0; // Disable Gated Timer mode
    T2CONbits.TCKPS = 0b01; // Select 8:1 Prescaler
    TMR2 = 0x00; // Clear timer register
    PR2 = 0xFFFF; // Load the period value
    IPC1bits.T2IP = 0x01; // Set Timer1 Interrupt Priority Level
    IFS0bits.T2IF = 0; // Clear Timer1 Interrupt Flag
    IEC0bits.T2IE = 1; // Enable Timer1 interrupt
    T2CONbits.TON = 1; // Start Timer                            
     * /                      
    while(1){
        Nop();
        Nop();
    }
    */
    
	InitializeBoard();
    
	#if defined(USE_LCD)
	// Initialize and display the stack version on the LCD
	LCDInit();
	DelayMs(100);
	strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
		"                ");
	LCDUpdate();
	#endif

	// Initialize stack-related hardware components that may be 
	// required by the UART configuration routines
    TickInit();
	#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
	MPFSInit();
	#endif

	// Initialize Stack and application related NV variables into AppConfig.
	InitAppConfig();

    // Initiates board setup process if button is depressed 
	// on startup
	#ifdef bad
    if(BUTTON0_IO == 0u)
    {
		#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
		// Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
		DWORD StartTime = TickGet();
		LED_PUT(0x00);
				
		while(BUTTON0_IO == 0u)
		{
			if(TickGet() - StartTime > 4*TICK_SECOND)
			{
				#if defined(EEPROM_CS_TRIS)
			    XEEBeginWrite(0x0000);
			    XEEWrite(0xFF);
			    XEEWrite(0xFF);
			    XEEEndWrite();
			    #elif defined(SPIFLASH_CS_TRIS)
			    SPIFlashBeginWrite(0x0000);
			    SPIFlashWrite(0xFF);
			    SPIFlashWrite(0xFF);
			    #endif
			    
				#if defined(STACK_USE_UART)
				putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
				#endif

				LED_PUT(0x0F);
				while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
				LED_PUT(0x00);
				while(BUTTON0_IO == 0u);
				Reset();
				break;
			}
		}
		#endif

		#if defined(STACK_USE_UART)
        DoUARTConfig();
		#endif
    }
    #endif //bad
	// Initialize core stack layers (MAC, ARP, TCP, UDP) and
	// application modules (HTTP, SNMP, etc.)
    StackInit();

